import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;

public class asdasdas {

    public static void main(String[] args) {
        String a = "[\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": 0,\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-04\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": \"1\",\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-05\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": \"14\",\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-06\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": 0,\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-07\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": \"22\",\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-08\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": \"5\",\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-09\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": 0,\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-10\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": 0,\n" +
                "            \"电源异常标志\": 0,\n" +
                "            \"time\": \"2021-03-11\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"没胶粒报警标志\": 0,\n" +
                "            \"温度1过低标志\": 0,\n" +
                "            \"电源异常标志\": \"2\",\n" +
                "            \"time\": \"2021-03-12\"\n" +
                "        }\n" +
                "    ]";

        JSONArray ja = JSONArray.parseArray(a);

        for (int i = 0; i < ja.size(); i++) {

            JSONObject jb = ja.getJSONObject(i);


        }


        System.out.println(ja);
    }
}
